{
    "status": "ok",
    "totalResults": 395,
    "articles": [
    {
    "source": {
    "id": null,
    "name": "Yahoo Entertainment"
    },
    "author": "Lawrence Bonk",
    "title": "The second-gen HomePod is on sale for $175 right now",
    "description": "If you've been thinking of buying Apple's HomePod (2nd generation), now's the time to act — it's on sale right now at Verizon for $175. That's a significant $125 discount (42 percent off) and represents one of the best deals we've seen on the smart speaker to…",
    "url": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_3226799e-cef0-4e4f-a4ed-fe5c8332fb86",
    "urlToImage": "https://assets3.cbsnewsstatic.com/hub/i/r/2024/06/03/c3d5cee8-7e98-42a0-8fe3-0d1a46eef74f/thumbnail/1200x630/927aa30552b17d4334dcf710152e2053/inx-trooper-charges-dropped-060324.jpg?v=d7bbca61a2ddd34e0cfc8fb46aec1df3",
    "publishedAt": "2024-06-04T07:41:44Z",
    "content": "If you click 'Accept all', we and our partners, including 238 who are part of the IAB Transparency &amp; Consent Framework, will also store and/or access information on a device (in other words, use … [+678 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "ReadWrite"
    },
    "author": "Owen Good",
    "title": "Just Cause maker announces layoffs, closes two studios",
    "description": "It’s still a terrible year for employment in the video games development industry. Monday, Sweden-based Avalanche Studios Group, makers of… Continue reading Just Cause maker announces layoffs, closes two studios\nThe post Just Cause maker announces layoffs, cl…",
    "url": "https://readwrite.com/video-games-development-layoffs-just-cause-avalanche-studios/",
    "urlToImage": "https://readwrite.com/wp-content/uploads/2024/06/ss_c5f5d74cc8eb64bf182e79758875ad250e7d2c2f.jpg",
    "publishedAt": "2024-06-04T00:08:29Z",
    "content": "Its still a terrible year for employment in the video games development industry.\r\nMonday, Sweden-based Avalanche Studios Group, makers of the just-optioned-to-Hollywood Just Cause action franchise, … [+1704 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Hipertextual"
    },
    "author": "Quelian Sanz",
    "title": "Apple marca como obsoleto uno de sus iPhone más icónicos: adiós al soporte y las reparaciones",
    "description": "Apple acaba de actualizar su listado de dispositivos obsoletos. Un iPhone no está verdaderamente anticuado hasta que la compañía de Cupertino así lo indica en su lista oficial. Hoy hay malas noticias para los más nostálgicos, pues el iPhone 5s es el encargado…",
    "url": "http://hipertextual.com/2024/06/apple-marca-como-obsoleto-uno-de-sus-iphone-mas-iconicos-adios-al-soporte-y-las-reparaciones",
    "urlToImage": "https://imgs.hipertextual.com/wp-content/uploads/2021/10/Apple-Store-scaled.jpg",
    "publishedAt": "2024-06-04T08:19:01Z",
    "content": "Apple acaba de actualizar su listado de dispositivos obsoletos. Un iPhone no está verdaderamente anticuado hasta que la compañía de Cupertino así lo indica en su lista oficial. Hoy hay malas noticias… [+3063 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Hipertextual"
    },
    "author": "Luis Miranda",
    "title": "Qualcomm promete un PC de escritorio con Snapdragon X Elite",
    "description": "Qualcomm confirmó que llevará su nuevo chip Snapdragon X Elite a los ordenadores de todo tipo y tamaño, incluyendo los de escritorio. Durante la keynote de apertura en Computex 2024, el fabricante declaró que estamos ante un renacimiento del PC, encabezado su…",
    "url": "http://hipertextual.com/2024/06/qualcomm-pc-escritorio-snapdragon-x-elite",
    "urlToImage": "https://imgs.hipertextual.com/wp-content/uploads/2024/06/qualcomm-snapdragon-x-elite-00.jpg",
    "publishedAt": "2024-06-04T00:23:28Z",
    "content": "Qualcomm confirmó que llevará su nuevo chip Snapdragon X Elite a los ordenadores de todo tipo y tamaño, incluyendo los de escritorio. Durante la keynote de apertura en Computex 2024, el fabricante de… [+3368 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Xataka.com"
    },
    "author": "Javier Lacort",
    "title": "Microsoft va a necesitar para la era de la IA a quienes le dieron la espalda en la era del móvil: los desarrolladores",
    "description": "Microsoft está volviendo a cortejar a los desarrolladores de Windows para que transformen sus aplicaciones con IA. Pero le espera un reto tan difícil como con el que ya fracasó hace una década, cuando trató sin éxito de convencerles para que portaran sus apps…",
    "url": "https://www.xataka.com/empresas-y-economia/microsoft-va-a-necesitar-para-era-ia-a-quienes-le-dieron-espalda-era-movil-desarrolladores",
    "urlToImage": "https://i.blogs.es/11eff3/dest-2/840_560.jpeg",
    "publishedAt": "2024-06-04T06:00:35Z",
    "content": "Microsoft está volviendo a cortejar a los desarrolladores de Windows para que transformen sus aplicaciones con IA. Pero le espera un reto tan difícil como con el que ya fracasó hace una década, cuand… [+2868 chars]"
    }
    
   
  ]
}